In [1]:
# github.com/echtr

In [22]:
import numpy as np
import pandas as pd

In [23]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)
sozluk = {"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([2, 0, 5, 9, 0]),
 'var2': array([1, 8, 4, 7, 7]),
 'var3': array([1, 6, 4, 4, 8])}

In [24]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     2     1     1
1     0     8     6
2     5     4     4
3     9     7     4
4     0     7     8

In [25]:
df.index=["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     2     1     1
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [26]:
df.drop("a", axis=0)

   var1  var2  var3
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [27]:
df # görüldüğü üzere df'de bir değişiklik olmadı.

   var1  var2  var3
a     2     1     1
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [28]:
df.drop("a", axis=0, inplace=True)

In [30]:
df # inplace=True yazınca df değişkenine uygulamış oldu.

   var1  var2  var3
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [31]:
# fancy yöntemi ile yapma
l = ["c","e"]
df.drop(l, axis=0)

   var1  var2  var3
b     0     8     6
d     9     7     4

In [32]:
df

   var1  var2  var3
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [33]:
"var1" in df

True

In [34]:
l = ["var1","var2","var5"]
for i in l: print(i in df)

True
True
False

In [36]:
# mevcut sütunları kullanarak yeni bir sütün oluşturma
df["var4"] = df["var1"]/df["var2"]
df

   var1  var2  var3      var4
b     0     8     6  0.000000
c     5     4     4  1.250000
d     9     7     4  1.285714
e     0     7     8  0.000000

In [39]:
df.drop("var4", axis=1) # var4 isimli sütunu kaldırdık. || axis => 0: satır /  1: sütun

   var1  var2  var3
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [40]:
df

   var1  var2  var3      var4
b     0     8     6  0.000000
c     5     4     4  1.250000
d     9     7     4  1.285714
e     0     7     8  0.000000

In [41]:
df.drop("var4", axis=1, inplace=True)

In [42]:
df

   var1  var2  var3
b     0     8     6
c     5     4     4
d     9     7     4
e     0     7     8

In [ ]:
#fancy indexing ile de silme işlemi yapılabilir.